<template>
  <div class="about m-4" style="display: flex;
                                justify-content: center;
                                align-items: center">
      <b-container style='display: inline-block;'>

        <b-container class="bv-example-row mb-3">
          <b-row>
            <b-col>
              <div>
                <b-img src="../assets/icons8-bed-100.png" fluid alt="Fluid image"></b-img>
                <h4>Спане</h4>
                <p>Хижа Плевен предлага добри условия за спане, при регистрация ние ще ви запазим легло. Ако имате нужда от допълнителен брой легла, моля посочете във формата за регистрация. Около хижата има достатъчно голяма поляна за палаткуване, ако поради една или друга причина не може да отседнете в хижата.</p>
              </div>
            </b-col>
            <b-col>
              <div>
                <b-img src="../assets/icons8-hamburger-100.png" fluid alt="Fluid image"></b-img>
                <h4>Храна</h4>
                <p>Също така хижа Плевен разполага с кухня и прясно приготвена храна, която може да закупите на място в столовата. Освен това ние ще осигурим паста парти вечерта преди състезанието и диня парти на финала.</p>
              </div>
            </b-col>
            <b-col>
              <div>
                <b-img src="../assets/icons8-money-100.png" fluid alt="Fluid image"></b-img>
                <h4>Такса</h4>
                <p>Участието е безплатно. Ако събитието ви харесва и искате да ни подкрепите всеки има възможност да го направи в кутията за дарения, която ще бъде на видно място в столовата.</p>
              </div>
            </b-col>
            <b-col>
              <div>
                <b-img src="../assets/icons8-car-roof-box-100.png" fluid alt="Fluid image"></b-img>
                <h4>Транспорт</h4>
                <p>До хижа Плевен се стига след кратък 30 минутен преход от паркинга на ВЕЦ Видима. Ако не разполагате със собствен транспорт може да се комбинирате с някой от другите участници. Всъщност ултра маратонците не са толкова лоши хора и никой няма да ви открадне чорапите, докато спите в колата.</p>
              </div>
            </b-col>
          </b-row>
        </b-container>

        <div>
          <b-card bg-variant="dark" text-variant="white" title="GPX Track">
            <b-card-text>
              Ако не искате да се забатачите нейде по баирите и да няма после
              "Роска къде съм" сме ви приготвили трак който да заредите на вашите
              навигационни устройства.
            </b-card-text>
              <b-row>
                <b-col></b-col>
                <b-col><b-button href="#" variant="danger">Свали GPX 80k ULTRA</b-button></b-col>
                <b-col><b-button href="#" variant="info">Свали GPX 13k SKY</b-button></b-col>
              </b-row>
          </b-card>
        </div>

        <div class="rules p-3">
          <h3>Условия за участие <strong>80k ULTRA</strong></h3>
          <ol>
            <li>Всеки от участниците трябва да има предоставена валидна планинска застраховка преди старта на състезанието.</li>
            <li>Завършени две състезания с минимум 4000 метра D+ всяко за последните 3 години /период 2017 - 2020 г./. Дължината на състезанията е без значение.</li>
            <li>Разполагате със собствено GPS устройство /часовник, pъчен GPS, мобилен телефон с планинарска карта/ и може да се ориентирате по предоставена GPS следа. Вграден чип в главата от Бил Гейтс не се приема.</li>
            <li>Всякаква помощ извън контролните пунктове е забранена, и ако разберем ще трябва да ви дисквалифицираме, сори.</li>
          </ol>
        </div>
      </b-container>
  </div>
</template>

<style scoped>
h3 {
  color: var(--dark);
}
.what-is {
  background-color: rgb(241, 241, 241);
  box-shadow: 0 2px 2px 0px rgb(107, 107, 107);
}
.rules {
  background-color: var(--orange);
  box-shadow: 0 2px 2px 0px rgb(107, 107, 107);
}
</style>
